---
title: IndexStreamLine
classe: Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: Autodesk.Revit.DB.DirectContext3D.IndexStream
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# IndexStreamLine

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Void AddLine(IndexLine)` | `indexStreamLine.AddLine(line)` | Void |
| `Void AddLines(IList<IndexLine>)` | `indexStreamLine.AddLines(lines)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```